#ifndef ATOMICCODE_H_
#define ATOMICCODE_H_


#ifdef	__cplusplus
extern "C" {
#endif

/*!  \file 	cmd_proc.h
 *   \brief  
 */

/*includes==========================================================================================================*/



/*defines===========================================================================================================*/
#define	STORAGE_ATOMIC()	 ;  // TODO: надо бы перейти на хранение sr в стеке

#define	START_ATOMIC()		{;}
#define	STOP_ATOMIC()		{;}
	

/*types=============================================================================================================*/

    
    
/*prototypes========================================================================================================*/

    
#ifdef	__cplusplus
	}
#endif

#endif /* ATOMICCODE_H_ */
