/*!  \file 	dac.c
 *   \brief  
 *   \details  
 *
 *
 *
 */

/*includes==========================================================================================================*/
#include "ad9116.h"
#include <stm32f4xx_hal.h>

/*defines===========================================================================================================*/


/*types=============================================================================================================*/


/*prototypes========================================================================================================*/


/*variables=========================================================================================================*/
static	uint8_t		clock_timer_disabled;		/* флаг указывающий работает или нет тактирующий таймер 1-выключен, 0-включен*/

/*code==============================================================================================================*/

/*=============================================================================================================*/
/*!  \brief конфигурируем интерфейсы последовательный и параралельный для управлениея ЦАПом

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int     ad9116_open
    (
     int dac_index      /*!< [in] индекс цапа 0-3 */
     )
    {
    
        /* конфигурирование ног паралелльной шины как выходов */
        
    
        /* включение интерфейса SPI2 */
	    
        
	    
        /* включение тактирующего таймера */
	    if (clock_timer_disabled)
	    {
		    clock_timer_disabled = 0;
		    
	    }
    
        return OK;
    }



/*=============================================================================================================*/
/*!  \brief выключаем интерфейсы работаюшие с ЦАП

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int     ad9116_close
    (
     int dac_index      /*!< [in] индекс цапа 0-3 */
     )
    {    
    /**/

	    
    if (!clock_timer_disabled)
    {
	    clock_timer_disabled = 1;
    }
	    
    return OK;    
    }



/*=============================================================================================================*/
/*!  \brief  Запись цифровых данных в ЦАП

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int     ad9116_write
    (
     int                    dac_index,  /*!< [in] индекс цапа 0-3                           */
     enum AD9116_INTERFACE  interface,  /*!< [in] интерфейс по которому передаются данные   */
     uint8_t                *data,      /*!< [in] указатель на передаваемые в ЦАП данные    */
     uint8_t                len         /*!< [in] длина передаваемых данных в байтах        */
     )
    {
    /**/
    
    return OK;    
    }
    



/*=============================================================================================================*/
/*!  \brief Чтение данных с ЦАП

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int     ad9116_read
    (
     int                    dac_index,   /*!< [in] индекс цапа 0-3                           */
     enum AD9116_INTERFACE  interface,   /*!< [in] интерфейс по которому передаются данные   */
     uint8_t                *data,       /*!< [in] указатель на передаваемые в ЦАП данные    */
     uint8_t                len          /*!< [in] длина передаваемых данных в байтах        */
     )
    {
    /**/
    
    return OK;    
    }
    

