/*!  \file 	dac.c
 *   \brief  
 *   \details  
 *
 *
 *
 */

/*includes==========================================================================================================*/
#include "dac.h"
#include "ad9116.h"
#include <stm32f4xx_hal.h>

/*defines===========================================================================================================*/


/*types=============================================================================================================*/


/*prototypes========================================================================================================*/


/*variables=========================================================================================================*/
static dac_values_t dac_buffer[4] = 
{ 
	{ 0x800, 0x800 },
	{ 0x800, 0x800 },
	{ 0x800, 0x800 },
	{ 0x800, 0x800 },			
};


/*code==============================================================================================================*/
int     dac_open
    (
		cu_type_sts_t	type
    )
{
	ad9116_idacgain_t	dacgain;	
	uint8_t				version = 0;
	
	/* конфигурируем интерфейсы ЦАПов */
	if (CU_TYPE_HETERODIN == type)
	{
		ad9116_open(DAC_01);
//		ad9116_open(DAC_23);
//		ad9116_open(DAC_45);
	} else {
		;
	}
	
	/* конфигурируем шкалу цап, настраиваем */
	for (;;)
	{
//		dacgain.gain = 33;
//		ad9116_write_register(DAC_01, AD9116_IDACGAIN_ADDR, &dacgain);
//		
//		dacgain.gain = 0;
//		ad9116_read_register(DAC_01, AD9116_IDACGAIN_ADDR, &dacgain);
//		
		version = 0;
		ad9116_read_register(DAC_01, AD9116_VERSION_ADDR, &version);
		
		continue;
	}
	
    
	return OK;
}



